fio_log/seqwrite.log
fio: this platform does not support process shared mutexes, forcing use of threads. Use the 'thread' option to get rid of this warning.
seqwrite: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=windowsaio, iodepth=1
fio-3.38
Starting 1 thread
seqwrite: Laying out IO file (1 file / 10240MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=10784: Mon Dec 16 21:19:37 2024
  write: IOPS=3952, BW=494MiB/s (518MB/s)(10.0GiB/20726msec); 0 zone resets
    slat (usec): min=4, max=30334, avg=58.25, stdev=115.52
    clat (nsec): min=87, max=41779k, avg=193732.54, stdev=936436.12
     lat (usec): min=18, max=41797, avg=251.99, stdev=936.63
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    4],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    8], 60.00th=[   11],
     | 70.00th=[   14], 80.00th=[   18], 90.00th=[   24], 95.00th=[   68],
     | 99.00th=[ 5211], 99.50th=[ 5800], 99.90th=[ 6783], 99.95th=[ 7767],
     | 99.99th=[10814]
   bw (  KiB/s): min=308375, max=4650666, per=100.00%, avg=508036.93, stdev=702252.62, samples=41
   iops        : min= 2409, max=36333, avg=3968.95, stdev=5486.31, samples=41
  lat (nsec)   : 100=0.02%, 250=0.06%, 500=0.05%, 750=0.03%, 1000=0.04%
  lat (usec)   : 2=0.06%, 4=26.47%, 10=32.02%, 20=26.57%, 50=9.23%
  lat (usec)   : 100=0.73%, 250=0.42%, 500=0.03%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=2.17%, 10=2.07%, 20=0.02%, 50=0.01%
  cpu          : usr=0.00%, sys=19.30%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=494MiB/s (518MB/s), 494MiB/s-494MiB/s (518MB/s-518MB/s), io=10.0GiB (10.7GB), run=20726-20726msec